packages/windninjapy/windninjapy-0.0.1-cp39-cp39-macosx_10_14_x86_64.macosx_14_0_arm64.whl/windninjapy/data/ninjafoam/2.2.0/system/sampleDict_transect
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

interpolationScheme cellPoint;

setFormat  raw;

fields
(
    U
);

sets 
( 
    transect 
    { 
        type            uniform; 
        axis            $axis$; 
        start           ($xstart$ $ystart$ $zstart$); 
        end             ($xend$ $yend$ $zend$); 
        nPoints         $nPoints$; 
    } 
); 

// *********************************************************************** //
